#!/bin/bash

# 1. Перезагружаемся в режим восстановления
echo "Перезагружаемся в режим восстановления:"
sudo systemctl reboot --force --firmware-setup

# 2. Перемонтируем файловую систему в режим только для чтения
echo "Перемонтируем корневую файловую систему в режим только для чтения (если это не было сделано автоматически):"


# 3. Выполняем проверку файловой системы с помощью fsck
echo "Проверяем корневую файловую систему / и автоматически исправляем ошибки:"


# 4. После завершения проверки перезагружаем систему
echo "После завершения проверки перезапустите систему с помощью команды reboot:"
